Revit 2024 API
BuiltInFailures.MEPCalculationFailures.MechanicalEquipmentSetBeingDeleted Property
 The mechanical equipment set was deleted because it no longer contained any members.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId MechanicalEquipmentSetBeingDeleted { get; }
Visual Basic
Public Shared ReadOnly Property MechanicalEquipmentSetBeingDeleted As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ MechanicalEquipmentSetBeingDeleted {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace